### Домашнее задание по уроку №5:
# from lesson5 import mixed_list

# 1. Создай список из 5 своих любимых фильмов и выведи второй фильм в списке.
films = ["Great Gatsby", "The vow", "The boy in the striped pyjamas", "Step up", "Despicable me"]
print(films[1])

# 2. Дан список чисел: [10, 20, 30, 40, 50]. 
# Замени число 30 на 99 и выведи обновленный список.
numbers = [10, 20, 30, 40, 50 ]
numbers [2] = 99
print(numbers)

# 3. Создай два списка: ["яблоко", "банан", "апельсин"] и ["кот", "собака", "тигр"].
# Объедини их в один список и выведи результат.
fruits = ["яблоко", "банан", "апельсин"]
animals = ["кот", "собака", "тигр"]
fruits.append(animals)
print(fruits)

# 4. Есть список [4, 2, 9, 1]. 
# Добавь число 7 в конец списка, затем удали число 2. Выведи итоговый список.
numbers = [4, 2, 9, 1]
numbers.append(7)
numbers.remove(2)
print(numbers)

# 5. Дан список ["Python", "Java", "C++", "JavaScript", "PHP"].
# Выведи первые три элемента списка.
words=["Python", "Java", "C++", "JavaScript", "PHP"]
print( words [0], words [1], words [2])

# 6. Дан список имен ["Аня", "Борис", "Вика"]. 
# Выведи имя, которое стоит на втором месте.
names = ["Аня", "Борис", "Вика"]
print(names[1])

# 7. Дан список чисел [5, 10, 15, 20, 25]. 
# Выведи список в обратном порядке с помощью среза.
numbers=[5, 10, 15, 20, 25]
print(numbers [::-1])

# 8. Создай пустой список и добавь в него три числа: 5, 10 и 15.
numbers = [ ]
numbers.append(5)
numbers.append(10)
numbers.append(15)
print(numbers)

# 9. Дан список чисел [10, 15, 20, 25, 30]. 
# Выведи первый и последний элементы списка.
numbers = [10, 15, 20, 25, 30]
print(numbers[0], numbers[-1])

# 10. Даны два списка: [1, 2, 3] и [4, 5, 6].
# Объедини их в один список и выведи.
num1 = [1, 2, 3]
num2 = [4, 5, 6]
mixed_list = num1 + num2
print(mixed_list)

# 11. Дан список чисел [2, 7, 3, 8, 5, 9]. 
# Найди сумму первых трех элементов списка.
numbers = [2, 7, 3, 8, 5, 9]
sum_numbers = numbers[0] + numbers[1] + numbers[2]
print(sum_numbers)

# 12. Дан список строк ["apple", "banana", "cherry", "date"].
# Выведи длину первого слова в списке.
fruits = ["apple", "banana", "cherry", "date"]
print(len(fruits[0]))

# 13. Дан список [100, 200, 300, 400, 500]. 
# Разверни список и выведи его.
numbers = [100, 200, 300, 400, 500]
numbers.reverse()
print(numbers)

# 14. Дан список чисел [1, 2, 3, 4, 5, 6, 7, 8, 9, 10].
# Создай новый список, содержащий только первые пять чисел.
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ]
first_five_numbers = numbers[:5]
print(first_five_numbers)

# 15. Дан список строк ["кот", "собака", "тигр", "лев", "слон"]. 
# Выведи последний элемент списка.
#
animals = ["кот", "собака", "тигр", "лев", "слон"]
last_animals = animals[-1]
print(last_animals)

# 16. Создай список из трех чисел. 
# Найди максимальное и минимальное значение, используя встроенные функции max() и min().
numbers = [25, 30, 40]
print("Максимум чисел:",  max(numbers))
print("Минимум чисел:", min(numbers))

# 17. Дан список строк ["яблоко", "банан", "вишня", "дыня"]. 
# Проверь, есть ли в списке слово "груша", и выведи "Есть" или "Нет".
fruits = ["яблоко", "банан", "вишня", "дыня"]
print(fruits)
if "груша" in fruits:
    print("Есть")
else:
    print("Нет")

# 18. Дан список [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]. 
# Замени число 4 на строку "четыре".

numbers=[1,2,3,4,5,6,7,8,9,10]
numbers[3] = "четыре"
print(numbers)

# 19. Дан список чисел [3, 6, 9, 12, 15]. 
# Умножь число 9 на 2 и выведи новый список.

numbers = [3, 6, 9, 12, 15]
new_numbers = [3, 6, 9 * 2, 12, 15]
numbers = new_numbers

print(numbers)

# 20. Дан двумерный список [[1, 2], [3, 4], [5, 6]]. 
# Выведи число 5, обратившись к нужному индексу.

numbers=[[1, 2], [3, 4], [5, 6]]
print(numbers[2][0])

# 21. Дан список [10, 20, 30, 40, 50].
# Вставь число 25 перед числом 30.

numbers = [10, 20, 30, 40, 50]
numbers.insert(numbers.index(30), 25)

print(numbers)

# 22. Дан список строк ["один", "два", "три", "четыре"].
# Преврати первое слово в списке в заглавные буквы.

list = ["один", "два", "три", "четыре"]
list[0] = list[0].upper()
print(list)

# 23. Дан список чисел [4, 16, 25, 36].
# Найди квадратный корень первого элемента.

numbers = [4, 16, 25, 36]
numbers =  numbers[0] * 0.5
print(numbers)

# 24. Дан список [5, 10, 15, 20].
# Найди разность между максимальным и минимальным значением.

numbers = [5, 10, 15, 20]
numbers = max(numbers) - min(numbers)
print(numbers)

# 25. Создай список из 5 имен и отсортируй его в обратном алфавитном порядке.

names = ["Иван", "Анна", "Белла", "Андрей", "Женя"]
new_names = sorted(names)
print(new_names)

# 26. Дан список [1, 1, 2, 2, 3, 3, 4, 4].
# Определи, сколько раз встречается число 2.

numbers = [1, 1, 2, 2, 3, 3, 4, 4]
new_numbers = numbers.count(2)
print(new_numbers)

# 27. Дан список чисел от 1 до 10.
# Создай новый список, содержащий первые три элемента и последние три элемента.

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
first_three = numbers[:3]
last_three = numbers[-3:]
print(first_three + last_three)

# 28. Дан список строк ["питон", "java", "c++", "javascript"].
# Преобразуй второй элемент в заглавные буквы и выведи.

words = ["питон", "java", "c++", "javascript"]
words[1] = words[1].upper()
print(words)

# 29. Даны два списка одинаковой длины: [1, 2, 3] и [4, 5, 6].
# Создай новый список, состоящий из сложенных попарно элементов двух списков.

list1 = [1, 2, 3]
list2 = [4, 5, 6]
new_list = [1+4,2+5,3+6] #А есть ли способ сделать это с помощью какой то функции?
print(new_list)

# 30. Дан список чисел [10, 20, 30, 40, 50].
# Выведи произведение первого и последнего элементов списка.

numbers = [10, 20, 30, 40, 50]
print(numbers[0] * numbers [-1])


# 31. Дан список имен ["Алекс", "Маша", "Олег", "Вика"].
# Определи, есть ли в списке имя "Олег".

names = ["Алекс", "Маша", "Олег", "Вика"]
print(names)
print("Олег" in names)

# 32. Дан список чисел [3, 6, 9, 12].
# Замени третий элемент списка на 99.

numbers = [3, 6, 9, 12]
numbers[2] = 99
print(numbers)

# 33. Дан список строк ["кот", "собака", "тигр"].
# Соедини первый и последний элементы списка в одну строку.

list = ["кот", "собака", "тигр"]
mixed_list = [[list[0]] + [list[2]]]
print(mixed_list)

# 34. Дан список чисел [5, -2, 3, -1, 6, -3].
# Определи, есть ли в списке отрицательное число.

# numbers = [5, -2, 3, -1, 6, -3]
# found_negative = num < 0 for num in numbers #Не понятно как делать?
#
# print(found_negative) if else!!!!

# 35. Дан список [10, 20, 30, 40, 50].
# Разбей его на два подсписка: первый с первыми двумя элементами, второй с оставшимися.
#
list = [10, 20, 30, 40, 50]
list1 = list[:2]
list2 = list[2:]
print(list1, list2)

# 36. Дан список чисел [1, 2, 3, 4, 5].
# Замени первый элемент на его квадрат.

numbers= [1, 2, 3, 4, 5]
numbers[0] = numbers[0] ** 2
print(numbers)


# 37. Дан список строк ["hello", "world", "python"].
# Создай новый список, содержащий только первое и последнее слова.

list = ["hello", "world", 'python']
new_list = list[0], list[-1]
print(new_list)

# 38. Дан список чисел [12, 5, 8, 15, 30].
# Найди разницу между вторым и третьим элементами.

numbers = [12, 5, 8, 15, 30]
print(numbers[1] - numbers[2])

# 39. Дан список слов ["apple", "banana", "cherry", "date"].
# Выведи второе слово в обратном порядке.
#
list = ["apple", "banana", "cherry", "date"]
word = list[1]
reversed_word = word[::-1]

print(reversed_word)

# 40. Дан двумерный список [[2, 4, 6], [1, 3, 5], [8, 10, 12]].
# Выведи первый элемент второго подсписка.

list = [[2, 4, 6], [1, 3, 5], [8, 10, 12]]
print(list[1][0])
